dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
#include "CONFIG.h"
#include "HAL.h"

#include <string.h>

#include "aik_spi_protocol.h"
#include "ch585_ads7948_mux_acq.h"
#include "ch585_half_report.h"
#if CH585_BLE_HID_ENABLE
#include "ble_hid.h"
#endif
#include "ch585_rf_nkro_tx.h"
#include "ch585_spi0_slave_link.h"
#include "magnetic_key_engine.h"

__attribute__((aligned(4))) uint32_t MEM_BUF[BLE_MEMHEAP_SIZE / 4];

#ifndef CH585_HALF_ID
#define CH585_HALF_ID AIK_HALF_ID_LEFT
#endif

#ifndef CH585_RF_TX_ENABLE
#define CH585_RF_TX_ENABLE 0
#endif

#ifndef CH585_BLE_HID_ENABLE
#define CH585_BLE_HID_ENABLE 0
#endif

#ifndef CH585_SPI_ACCEPT_HOST_CMD
#define CH585_SPI_ACCEPT_HOST_CMD (CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE)
#endif

#ifndef CH585_HALF_SCAN_DEBUG_UART
#define CH585_HALF_SCAN_DEBUG_UART 0
#endif

#ifndef CH585_HALF_SCAN_DEBUG_UART_BAUD
#define CH585_HALF_SCAN_DEBUG_UART_BAUD 921600U
#endif

#ifndef CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES
#define CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES 100U
#endif

#ifndef CH585_LOCAL_ROTARY_PULSE_FRAMES
#define CH585_LOCAL_ROTARY_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_WHEEL_PULSE_FRAMES
#define CH585_LOCAL_WHEEL_PULSE_FRAMES 32U
#endif

#ifndef CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT
#define CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT 2
#endif

#ifndef CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT
#define CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT 2
#endif

#ifndef CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES
#define CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES 3U
#endif

#ifndef CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES
#define CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES 6U
#endif

#ifndef CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES
#define CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES
#define CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES 12U
#endif

#ifndef CH585_LOCAL_BUTTON_PULSE_FRAMES
#define CH585_LOCAL_BUTTON_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_BUTTON_COOLDOWN_FRAMES
#define CH585_LOCAL_BUTTON_COOLDOWN_FRAMES 100U
#endif

#ifndef BLE_HID_KBD_REPORT_LEN
#define BLE_HID_KBD_REPORT_LEN 8U
#endif

#define CH585_LOCAL_SWITCH_CENTER_MASK 0x01U
#define CH585_LOCAL_SWITCH_UP_MASK     0x02U
#define CH585_LOCAL_SWITCH_DOWN_MASK   0x04U
#define CH585_LOCAL_SWITCH_RIGHT_MASK  0x08U
#define CH585_LOCAL_SWITCH_LEFT_MASK   0x10U
#define CH585_LOCAL_SWITCH_DIR_MASK    0x1EU

#define CH585_LOCAL_SWITCH_GESTURE_NONE    0U
#define CH585_LOCAL_SWITCH_GESTURE_PENDING 1U
#define CH585_LOCAL_SWITCH_GESTURE_ENTER   2U
#define CH585_LOCAL_SWITCH_GESTURE_DIR     3U

#if CH585_HALF_SCAN_DEBUG_UART && !defined(DEBUG)
#error CH585_HALF_SCAN_DEBUG_UART requires DEBUG=Debug_UART1 or another WCH DEBUG UART.
#endif

static ch585_ads7948_mux_acq_t s_acq;
static mag_key_engine_t s_engine;
static aik_spi_half_state_v1_t s_tx_frame __attribute__((aligned(4)));
static aik_spi_host_cmd_v1_t s_rx_cmd __attribute__((aligned(4)));
static aik_spi_profile_status_v1_t s_profile_status __attribute__((aligned(4)));
static aik_spi_half_state_v1_t s_right_frame __attribute__((aligned(4)));
static uint8_t s_rf_nkro16[AIK_NKRO_REPORT_BYTES];
#if CH585_BLE_HID_ENABLE
static uint8_t s_ble_boot8[BLE_HID_KBD_REPORT_LEN];
#endif
static uint16_t s_compact_raw[AIK_KEY_COUNT_RIGHT];
static int s_last_spi_result;
static uint8_t s_profile_status_pending;
static uint8_t s_right_frame_valid;
static uint8_t s_local_rotary_last_ab;
static int8_t s_local_rotary_accum;
static uint8_t s_local_rotary_cw_frames;
static uint8_t s_local_rotary_ccw_frames;
static uint32_t s_local_rotary_cw_total;
static uint32_t s_local_rotary_ccw_total;
static uint8_t s_local_rotary_debug_last_raw_ab;
static uint32_t s_local_rotary_debug_edge_count;
static volatile uint32_t s_local_rotary_debug_irq_count;
static volatile uint16_t s_local_rotary_debug_irq_flags;
static int16_t s_local_mouse_wheel_pending;
static uint8_t s_local_button_last_raw;
static uint8_t s_local_button_stable;
static uint8_t s_local_button_last_stable;
static uint8_t s_local_button_raw_count;
static uint8_t s_local_button_mute_frames;
static uint8_t s_local_button_mute_cooldown;
static uint8_t s_local_button_press_latched;
static uint8_t s_local_switch_last_raw;
static uint8_t s_local_switch_stable;
static uint8_t s_local_switch_raw_count;
static uint8_t s_local_switch_gesture;
static uint8_t s_local_switch_guard_frames;
static uint8_t s_local_switch_enter_frames;
#if CH585_BLE_HID_ENABLE
static uint32_t s_ble_sent_count;
static uint32_t s_ble_drop_count;
static uint16_t s_ble_last_consumer_usage;
#endif
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static uint8_t s_output_mode;
static int8_t s_last_output_mouse_wheel;
#endif

static ch585_ads7948_mux_side_t half_scan_side(void)
{
    return (CH585_HALF_ID == AIK_HALF_ID_RIGHT) ?
        CH585_ADS7948_MUX_SIDE_RIGHT :
        CH585_ADS7948_MUX_SIDE_LEFT;
}

static void half_scan_build_down_bits(void)
{
    uint8_t key;
    uint8_t key_count = aik_spi_half_key_count((uint8_t)CH585_HALF_ID);

    memset(s_tx_frame.down_bits, 0, sizeof(s_tx_frame.down_bits));
    for(key = 0U; key < key_count; key++)
    {
        const mag_key_state_t *state = mag_key_engine_state(&s_engine, key);

        if((state != 0) && (state->is_down != 0U))
        {
            s_tx_frame.down_bits[key >> 3] |= (uint8_t)(1U << (key & 7U));
        }
    }
}

static uint8_t half_scan_gpioa_pressed(uint32_t pin)
{
    return (GPIOA_ReadPortPin(pin) == 0U) ? 1U : 0U;
}

static uint8_t half_scan_gpiob_pressed(uint32_t pin)
{
    return (GPIOB_ReadPortPin(pin) == 0U) ? 1U : 0U;
}

static uint8_t half_scan_read_rotary_ab(void)
{
    uint8_t a = half_scan_gpioa_pressed(GPIO_Pin_10);
    uint8_t b = half_scan_gpioa_pressed(GPIO_Pin_11);

    return (uint8_t)(a | (uint8_t)(b << 1));
}

static uint8_t half_scan_read_rotary_raw_ab(void)
{
    uint8_t a = (GPIOA_ReadPortPin(GPIO_Pin_10) != 0U) ? 1U : 0U;
    uint8_t b = (GPIOA_ReadPortPin(GPIO_Pin_11) != 0U) ? 1U : 0U;

    return (uint8_t)(a | (uint8_t)(b << 1));
}

static void half_scan_local_gpio_init(void)
{
    GPIOADigitalCfg(ENABLE, GPIO_Pin_7 | GPIO_Pin_10 | GPIO_Pin_11);
    GPIOBDigitalCfg(ENABLE, GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7);
    GPIOA_ModeCfg(GPIO_Pin_10 | GPIO_Pin_11, GPIO_ModeIN_PU);
    s_local_rotary_debug_last_raw_ab = half_scan_read_rotary_raw_ab();
    s_local_rotary_debug_edge_count = 0U;
    s_local_rotary_debug_irq_count = 0U;
    s_local_rotary_debug_irq_flags = 0U;
#if CH585_HALF_SCAN_DEBUG_UART
    GPIOA_ClearITFlagBit(GPIO_Pin_10 | GPIO_Pin_11);
    GPIOA_ITModeCfg(GPIO_Pin_10 | GPIO_Pin_11, GPIO_ITMode_FallEdge);
    PFIC_EnableIRQ(GPIO_A_IRQn);
#endif
    if(CH585_HALF_ID == AIK_HALF_ID_LEFT)
    {
        GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
        GPIOB_ModeCfg(GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7,
                      GPIO_ModeIN_PU);
    }
    else
    {
        GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
    }

    s_local_rotary_last_ab = half_scan_read_rotary_ab();
    s_local_rotary_accum = 0;
    s_local_rotary_cw_frames = 0U;
    s_local_rotary_ccw_frames = 0U;
    s_local_rotary_cw_total = 0U;
    s_local_rotary_ccw_total = 0U;
    s_local_mouse_wheel_pending = 0;
    s_local_button_last_raw = 0U;
    s_local_button_stable = 0U;
    s_local_button_last_stable = 0U;
    s_local_button_raw_count = 0U;
    s_local_button_mute_frames = 0U;
    s_local_button_mute_cooldown = 0U;
    s_local_button_press_latched = 0U;
    s_local_switch_last_raw = 0U;
    s_local_switch_stable = 0U;
    s_local_switch_raw_count = 0U;
    s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_NONE;
    s_local_switch_guard_frames = 0U;
    s_local_switch_enter_frames = 0U;
}

static void half_scan_queue_local_mouse_wheel(int8_t delta)
{
    if(CH585_HALF_ID != AIK_HALF_ID_LEFT)
    {
        return;
    }

    if((delta > 0) && (s_local_mouse_wheel_pending < 32))
    {
        s_local_mouse_wheel_pending++;
    }
    else if((delta < 0) && (s_local_mouse_wheel_pending > -32))
    {
        s_local_mouse_wheel_pending--;
    }
}

