dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static int8_t half_scan_take_local_mouse_wheel(void)
{
    if(CH585_HALF_ID != AIK_HALF_ID_LEFT)
    {
        return 0;
    }

    if(s_local_mouse_wheel_pending > 0)
    {
        s_local_mouse_wheel_pending--;
        return 1;
    }
    if(s_local_mouse_wheel_pending < 0)
    {
        s_local_mouse_wheel_pending++;
        return -1;
    }
    return 0;
}
#endif

static uint8_t half_scan_debounce_u8(uint8_t raw,
                                     uint8_t mask,
                                     uint8_t threshold,
                                     uint8_t *last_raw,
                                     uint8_t *raw_count,
                                     uint8_t *stable)
{
    raw &= mask;
    if(raw == *last_raw)
    {
        if(*raw_count < threshold)
        {
            (*raw_count)++;
        }
    }
    else
    {
        *last_raw = raw;
        *raw_count = 1U;
    }

    if(*raw_count >= threshold)
    {
        *stable = raw;
    }
    return *stable;
}

static void half_scan_local_rotary_poll(void)
{
    static const int8_t s_quad_delta[16] =
    {
         0, -1,  1,  0,
         1,  0,  0, -1,
        -1,  0,  0,  1,
         0,  1, -1,  0
    };
    uint8_t raw_ab = half_scan_read_rotary_raw_ab();
    uint8_t next_ab = half_scan_read_rotary_ab();
    uint8_t index = (uint8_t)((s_local_rotary_last_ab << 2) | next_ab);
    uint8_t pulse_frames =
        (CH585_HALF_ID == AIK_HALF_ID_LEFT) ?
        CH585_LOCAL_WHEEL_PULSE_FRAMES :
        CH585_LOCAL_ROTARY_PULSE_FRAMES;
    int8_t steps_per_event =
        (CH585_HALF_ID == AIK_HALF_ID_RIGHT) ?
        (int8_t)CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT :
        (int8_t)CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT;

    if(raw_ab != s_local_rotary_debug_last_raw_ab)
    {
        s_local_rotary_debug_last_raw_ab = raw_ab;
        s_local_rotary_debug_edge_count++;
    }

    s_local_rotary_last_ab = next_ab;
    s_local_rotary_accum =
        (int8_t)(s_local_rotary_accum + s_quad_delta[index & 0x0FU]);

    if(s_local_rotary_accum >= steps_per_event)
    {
        s_local_rotary_accum = 0;
        s_local_rotary_cw_frames = pulse_frames;
        s_local_rotary_ccw_frames = 0U;
        s_local_rotary_cw_total++;
        half_scan_queue_local_mouse_wheel(1);
    }
    else if(s_local_rotary_accum <= -steps_per_event)
    {
        s_local_rotary_accum = 0;
        s_local_rotary_ccw_frames = pulse_frames;
        s_local_rotary_cw_frames = 0U;
        s_local_rotary_ccw_total++;
        half_scan_queue_local_mouse_wheel(-1);
    }
}

static uint8_t half_scan_local_switch_stable_mask(void)
{
    uint8_t raw = 0U;

    if(half_scan_gpioa_pressed(GPIO_Pin_7) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_CENTER_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_7) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_UP_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_6) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_DOWN_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_5) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_RIGHT_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_4) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_LEFT_MASK;
    }

    return half_scan_debounce_u8(raw,
                                 CH585_LOCAL_SWITCH_CENTER_MASK |
                                     CH585_LOCAL_SWITCH_DIR_MASK,
                                 CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES,
                                 &s_local_switch_last_raw,
                                 &s_local_switch_raw_count,
                                 &s_local_switch_stable);
}

static void half_scan_apply_left_five_way(void)
{
    uint8_t stable = half_scan_local_switch_stable_mask();
    uint8_t center = (uint8_t)(stable & CH585_LOCAL_SWITCH_CENTER_MASK);
    uint8_t dirs = (uint8_t)(stable & CH585_LOCAL_SWITCH_DIR_MASK);

    if(center == 0U)
    {
        s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_NONE;
        s_local_switch_guard_frames = 0U;
        s_local_switch_enter_frames = 0U;
        return;
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_NONE)
    {
        s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_PENDING;
        s_local_switch_guard_frames = CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES;
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_PENDING)
    {
        if(dirs != 0U)
        {
            s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_DIR;
        }
        else if(s_local_switch_guard_frames != 0U)
        {
            s_local_switch_guard_frames--;
            return;
        }
        else
        {
            s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_ENTER;
            s_local_switch_enter_frames = CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES;
        }
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_ENTER)
    {
        if(s_local_switch_enter_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_CENTER);
            s_local_switch_enter_frames--;
        }
        return;
    }

    if(s_local_switch_gesture != CH585_LOCAL_SWITCH_GESTURE_DIR)
    {
        return;
    }

    if((dirs & CH585_LOCAL_SWITCH_UP_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_UP);
    }
    if((dirs & CH585_LOCAL_SWITCH_DOWN_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_DOWN);
    }
    if((dirs & CH585_LOCAL_SWITCH_RIGHT_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_RIGHT);
    }
    if((dirs & CH585_LOCAL_SWITCH_LEFT_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_LEFT);
    }
}

static void half_scan_local_button_poll(void)
{
    uint8_t stable = half_scan_debounce_u8(half_scan_gpioa_pressed(GPIO_Pin_7),
                                          1U,
                                          CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES,
                                          &s_local_button_last_raw,
                                          &s_local_button_raw_count,
                                          &s_local_button_stable);

    if(s_local_button_mute_cooldown != 0U)
    {
        s_local_button_mute_cooldown--;
    }

    if(stable == 0U)
    {
        s_local_button_press_latched = 0U;
    }
    else if((s_local_button_press_latched == 0U) &&
            (s_local_button_last_stable == 0U) &&
            (s_local_button_mute_cooldown == 0U))
    {
        s_local_button_mute_frames = CH585_LOCAL_BUTTON_PULSE_FRAMES;
        s_local_button_mute_cooldown = CH585_LOCAL_BUTTON_COOLDOWN_FRAMES;
        s_local_button_press_latched = 1U;
    }
    s_local_button_last_stable = stable;
}

static void half_scan_encode_right_rotary_counts(void)
{
    aik_spi_half_set_2bit(
        &s_tx_frame,
        AIK_RIGHT_LOCAL_ROTARY_CW_COUNT_SHIFT,
        (uint8_t)(s_local_rotary_cw_total &
                  AIK_RIGHT_LOCAL_ROTARY_COUNT_MASK));
    aik_spi_half_set_2bit(
        &s_tx_frame,
        AIK_RIGHT_LOCAL_ROTARY_CCW_COUNT_SHIFT,
        (uint8_t)(s_local_rotary_ccw_total &
                  AIK_RIGHT_LOCAL_ROTARY_COUNT_MASK));
}

static void half_scan_apply_local_inputs(void)
{
    if(CH585_HALF_ID == AIK_HALF_ID_LEFT)
    {
        half_scan_local_rotary_poll();
        half_scan_apply_left_five_way();
        if(s_local_rotary_cw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_WHEEL_UP);
            s_local_rotary_cw_frames--;
        }
        if(s_local_rotary_ccw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_WHEEL_DOWN);
            s_local_rotary_ccw_frames--;
        }
    }
    else
    {
        half_scan_local_rotary_poll();
        half_scan_local_button_poll();
        half_scan_encode_right_rotary_counts();
        if(s_local_rotary_cw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_CW);
            s_local_rotary_cw_frames--;
        }
        if(s_local_rotary_ccw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_CCW);
            s_local_rotary_ccw_frames--;
        }
        if(s_local_button_mute_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_MUTE);
            s_local_button_mute_frames--;
        }
    }
}

static void half_scan_compact_raw(const ch585_ads7948_mux_acq_t *acq,
                                  uint16_t *compact,
                                  uint8_t key_count)
{
    const uint16_t *raw;
    const ch585_ads7948_mux_profile_t *profile;
    uint8_t key = 0U;
    uint8_t lane_index;

    if((acq == 0) || (compact == 0) || (acq->profile == 0))
    {
        return;
    }

    raw = ch585_ads7948_mux_acq_raw(acq);
    profile = acq->profile;
    for(lane_index = 0U;
        (lane_index < CH585_ADS7948_MUX_LANE_COUNT) && (key < key_count);
        lane_index++)
    {
        const ch585_ads7948_mux_lane_t *lane = &profile->lanes[lane_index];
        uint8_t mux;
        uint8_t mux_end = (uint8_t)(lane->mux_first + lane->mux_count);

        for(mux = lane->mux_first; (mux < mux_end) && (key < key_count); mux++)
        {
            uint16_t raw_index =
                ((uint16_t)lane_index * CH585_ADS7948_MUX_MUX_CHANNEL_COUNT) +
                (uint16_t)mux;

