dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
    memset(&s_acq, 0, sizeof(s_acq));
    memset(&s_engine, 0, sizeof(s_engine));
    memset(&s_tx_frame, 0, sizeof(s_tx_frame));
    memset(&s_rx_cmd, 0, sizeof(s_rx_cmd));
    memset(&s_profile_status, 0, sizeof(s_profile_status));
    memset(&s_right_frame, 0, sizeof(s_right_frame));
    memset(s_rf_nkro16, 0, sizeof(s_rf_nkro16));
    memset(s_compact_raw, 0, sizeof(s_compact_raw));
    s_last_spi_result = 0;
    s_profile_status_pending = 0U;
    s_right_frame_valid = 0U;
#if CH585_BLE_HID_ENABLE
    memset(s_ble_boot8, 0, sizeof(s_ble_boot8));
    s_ble_sent_count = 0U;
    s_ble_drop_count = 0U;
    s_ble_last_consumer_usage = AIK_CONSUMER_USAGE_NONE;
#endif
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
    s_output_mode = 0xFFU;
    s_last_output_mouse_wheel = 0;
#endif

    ch585_ads7948_mux_gpio_init();
    half_scan_local_gpio_init();
    (void)ch585_ads7948_mux_acq_init(&s_acq, profile);

    mag_key_default_config(&cfg);
    cfg.mode = MAG_KEY_MODE_RAPID_TRIGGER;
    (void)mag_key_engine_init(&s_engine,
                              aik_spi_half_key_count((uint8_t)CH585_HALF_ID),
                              &cfg);

    ch585_spi0_slave_link_init();
#if CH585_RF_TX_ENABLE
    ch585_rf_nkro_tx_init();
#endif
#if CH585_BLE_HID_ENABLE
    BLE_HID_Init();
#endif
#if CH585_RF_TX_ENABLE && CH585_BLE_HID_ENABLE
    half_scan_set_output_mode(AIK_OUTPUT_MODE_USBHS);
#elif CH585_RF_TX_ENABLE
    half_scan_set_output_mode(AIK_OUTPUT_MODE_RF24);
#elif CH585_BLE_HID_ENABLE
    half_scan_set_output_mode(AIK_OUTPUT_MODE_BLE);
#endif

    ch585_ads7948_mux_acq_poll(&s_acq);
    half_scan_compact_raw(&s_acq,
                          s_compact_raw,
                          aik_spi_half_key_count((uint8_t)CH585_HALF_ID));
    (void)mag_key_engine_update(&s_engine, s_compact_raw);
    half_scan_build_frame();
}

#if CH585_HALF_SCAN_DEBUG_UART
__INTERRUPT
void GPIOA_IRQHandler(void)
{
    uint16_t flags = GPIOA_ReadITFlagPort();
    uint16_t rotary_flags = (uint16_t)(flags & (GPIO_Pin_10 | GPIO_Pin_11));

    if(rotary_flags != 0U)
    {
        s_local_rotary_debug_irq_count++;
        s_local_rotary_debug_irq_flags |= rotary_flags;
    }

    if(flags != 0U)
    {
        GPIOA_ClearITFlagBit(flags);
    }
}
#endif

int main(void)
{
    half_scan_init();

    while(1)
    {
        uint8_t key_count = aik_spi_half_key_count((uint8_t)CH585_HALF_ID);

        s_last_spi_result =
            ch585_spi0_slave_link_receive_frame((uint8_t *)&s_rx_cmd,
                                                AIK_SPI_HOST_CMD_SIZE);
        if(s_last_spi_result == CH585_SPI0_SLAVE_LINK_OK)
        {
            half_scan_apply_host_cmd();
        }
        if(s_profile_status_pending != 0U)
        {
            s_last_spi_result =
                ch585_spi0_slave_link_serve_tx_frame(
                    (const uint8_t *)&s_profile_status,
                    AIK_SPI_HALF_STATE_SIZE);
            s_profile_status_pending = 0U;
        }
        else
        {
            s_last_spi_result =
                ch585_spi0_slave_link_serve_tx_frame(
                    (const uint8_t *)&s_tx_frame,
                    AIK_SPI_HALF_STATE_SIZE);
        }
        ch585_ads7948_mux_acq_poll(&s_acq);
        half_scan_compact_raw(&s_acq, s_compact_raw, key_count);
        (void)mag_key_engine_update(&s_engine, s_compact_raw);
        half_scan_build_frame();
        half_scan_debug_poll(key_count);
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_poll();
#elif CH585_BLE_HID_ENABLE
        TMOS_SystemProcess();
#endif
    }
}
